<p id="main"> <article class="post"> <header> <div class="title"> <p>Voc&#xEA; costuma ler o manual de instru&#xE7;&#xF5;es? Veja como equipes t&#xEA;m trabalhado para contribuir e facilitar o aprendizado da linguagem R ampliando a intersec&#xE7;&#xE3;o entre a curiosidade de nossa infancia e o amadurecimento. Programar se torna uma tarefa divertida e pr&#xE1;tica mas sem abandonar o manual de instru&#xE7;&#xF5;es escrito por quem sabe do que esta falando!</p> </div> </header> <a href="https://gomesfellipe.github.io/post/2018-02-17-cheatsheet-gamificacao-r/cheatsheet-gamificacao-r/" class="image featured"> <img src="https://gomesfellipe.github.io/img/2018/02/img2.png" alt=""> </a> <div id="content"> <div id="voce-costuma-ler-o-manual" class="section level1"> <p>Quando eramos crian&#xE7;as geralmente n&#xE3;o tinhamos o costume de ler o manual das coisas n&#xE3;o &#xE9; mesmo? Particularmente eu sempre gostei de aprender como as coisas funcionavam diretamente com a pr&#xE1;tica para poder us&#xE1;-las depois. Adorava buscar entender como as coisas se encaixavam ao montar os brinquedinhos do kinder-ovo sem ler as instru&#xE7;&#xF5;es ou criar diferentes combina&#xE7;&#xF5;es com lego customizados, por exemplo. Acredito que isso seja da natureza de toda crian&#xE7;a!</p>
<div class="col2">
<p>Acontece que com o passar dos anos vamos adquirindo conhecimento e come&#xE7;amos a perceber que quanto mais aprendemos maior a quantidade de coisas novas que ainda temos a aprender.</p>
<p>Especialmente ao ler noticias do tipo: <a href="http://www.jornalciencia.com/einstein-estava-certo-cientistas-detectam-ondas-gravitacionais-comprovando-a-teoria-da-relatividade-geral/">&#x201C;Einstein estava certo a cem anos atr&#xE1;s!&#x201D;</a> depois de ele j&#xE1; ter tomado nota das ondas gravitacionais a tantos anos.. Um dever de casa que durou 100 anos foi deixado por um g&#xEA;nio e isso serve para nos lembra como somos &#x201C;pequenos&#x201D;, o quanto &#xE9; importante seguir boas refer&#xEA;ncias nos apoiando em ombros de gigantes para enxergar mais longe!</p>
<p>(Quem ai aos 22 anos, desenvolveu o c&#xE1;lculo infinitesimal, as bases da teoria das cores, contribuiu com o estudo da &#xF3;tica, formulou conceitos sobre as leis do movimento planet&#xE1;rio e virou lenda com um famoso incidente da ma&#xE7;&#xE3; que levou a formular a teoria da gravidade? Ser&#xE1; que <a href="https://www.oficinadanet.com.br/post/15839-isaac-newton-o-maior-genio-de-todos-os-tempos">Isaac Newton</a> conhece alguem?)</p>
<div class="figure">
<img src="http://i.giphy.com/IZ4EXtpPkamXe.gif"> </div>
</div>
<p>Isso faz pensar em como &#xE9; importante ouvir (ou ler) quem entende do assunto para darmos nossos pr&#xF3;ximos passos</p>
</div>
<div id="mas-o-r-tem-manual" class="section level1"> <p>Seja estudando estat&#xED;stica, programa&#xE7;&#xE3;o em R, qualquer outra mat&#xE9;ria ou mesmo configurando seu rel&#xF3;gio, montando um daqueles m&#xF3;veis complicados ou que seja montando um avi&#xE3;o! Nem tudo precisa ser um quebra cabe&#xE7;a, n&#xE3;o importa o qu&#xE3;o &#xE1;vido por saber, consultar o manual (ou um livro se torna uma tarefa fundamental para darmos o pr&#xF3;ximo passo!</p>
<p>A medida que vamos avan&#xE7;ando no aprendendizado da linguagem R, mais consultas ao <a href="https://www.r-project.org/help.html">&#x201C;Help&#x201D;</a> v&#xE3;o sendo realizadas. Isso ocorre tamb&#xE9;m quando avan&#xE7;amos no estudo de qualquer &#xE1;rea, acaba sendo natural elevar o n&#xFA;mero de consultas ao &#x201C;manual&#x201D;.</p>
<p>Acontece que nem sempre encontramos explica&#xE7;&#xF5;es detalhadas ou suficientes no Help para solucionar nossos problemas e em busca de mais detalhes e referencias quase sempre podemos encontrar <a href="http://r-pkgs.had.co.nz/vignettes.html">vignettes</a> (que s&#xE3;o guias longos para os pacotes, geralmente com exemplos reprodut&#xED;veis e algumas dicas para o uso) em uma breve pesquisa escrevendo: &#x201C;Nome do pacote&#x201D; + &#x201C;CRAN&#x201D; na busca do Google e geralmente logo no inicio j&#xE1; existe uma ou mais refer&#xEA;ncias al&#xE9;m do Help do RStudio no <a href="https://cran.r-project.org/">CRAN</a> disponibilizado pelos desenvolvedores dos pacotes.</p>
</div> <div id="aprendizagem-online-e-a-gamificacao" class="section level1"> <p>A <a href="https://en.wikipedia.org/wiki/Gamification">gamifica&#xE7;&#xE3;o</a> &#xE9; um conceito que vem sendo introduzido ap&#xF3;s a introdu&#xE7;&#xE3;o da tecnologia na hist&#xF3;ria. A id&#xE9;ia de se criar jogos para motivar e engajar as pessoas em atividades profissionais e a id&#xE9;ia de se estar em um jogo possibilita doses de motiva&#xE7;&#xE3;o especialmente a quem gosta de competir.</p>
<div id="datacamp" class="section level2"> <center>
<img src="https://nhorton.people.amherst.edu/rstudio/datacamp.png">
</center>
<p>No site oficial da <a href="https://www.rstudio.com/">RStudio</a> encontramos al&#xE9;m das cheatsheets, dentre seus recursos existe a op&#xE7;&#xE3;o de <a href="https://www.rstudio.com/online-learning/">aprendizagem online</a> onde &#xE9; apresentada a <a href="https://www.datacamp.com/">DataCamp</a> que &#xE9; o primeiro e um dos mais importantes l&#xED;deres em divulgar e ensinar Data Science, oferecendo treinamento baseado em habilidades, inova&#xE7;&#xE3;o t&#xE9;cnica pioneira e cursos oferecidos pelos melhores educadores do mundo em data science!(Descri&#xE7;&#xE3;o deles no <a href="https://www.datacamp.com/about">site</a>)</p>
<p>Apesar do site ser pago, existem diversas op&#xE7;&#xF5;es de cursos gratuitos para quem esta come&#xE7;ando e &#xE9; muito simples e f&#xE1;cil aprender pelo site. Ao cumprir com exerc&#xED;cios e terminar os cursos o usu&#xE1;rio ganha xp (pontos de experiencia) que registram sua evolu&#xE7;&#xE3;o. Pode ser um &#xF3;timo investimento para aprender com os melhores do mundo e o legal de tudo isso &#xE9; que nunca fica f&#xE1;cil!</p>
</div>
<div id="kaggle" class="section level2"> <center>
<div>
<div class="figure">
<img src="https://upload.wikimedia.org/wikipedia/commons/7/7c/Kaggle_logo.png"> </div>
</div>
</center>
<p>O <a href="https://www.kaggle.com/">kaggle</a> &#xE9; um playground para cientistas de dados, nele existem diversas modalidades e dentre elas uma das das que eu acho mais interessante s&#xE3;o as competi&#xE7;&#xF5;es de machine learning onde pessoas e empresas interessadas em adquirir ou at&#xE9; comparar seus resultados com os modelos feitos por uma enorme comunidade programando em diferentes linguagens est&#xE3;o testando para saber quem treina o modelo mais preciso e &#xE9; poss&#xED;vel acompanhar o c&#xF3;digo e o racioc&#xED;nio de cientistas de dados do mundo inteiro de maneira muito simples!</p>
<p>Tamb&#xE9;m existe a recompensa com pontos de experiencia para passar de n&#xED;vel, congratula&#xE7;&#xE3;o com medalhas dentre outras recopensas semelhantes ao dos games.</p>
<p>Existem os famosos <a href="https://www.kaggle.com/datasets">datasets</a> que s&#xE3;o os bancos de dados fornecidos pelos usu&#xE1;rios da plataforma e os <a href="https://www.kaggle.com/kernels">kernels</a> &#xE9; um &#xF3;timo lugar para compartilhar seu trabalho e debater sobre resultados de projetos e id&#xE9;ias de aplica&#xE7;&#xF5;es de outras pessoas</p>
<p>Ao contr&#xE1;rio da DataCamp, o Kaggle &#xE9; gratuito e existem competi&#xE7;&#xF5;es pagando at&#xE9; $100.000,00 para a pesosa (ou equipe) que apresentar os resultados mais satisfat&#xF3;rios!!</p>
</div>
</div>
<div id="para-refletir.." class="section level1"> <div class="col2">
<center>
<div>
<div class="figure">
<img src="https://cdn.pensador.com/img/authors/co/nf/confucio-2-l.jpg"> </div>
</div>
</center>
<blockquote>
<p>&#x201C;H&#xE1; tr&#xEA;s m&#xE9;todos de ganhar sabedoria: primeiro, por reflex&#xE3;o, que &#xE9; o mais nobre; segundo, por imita&#xE7;&#xE3;o, que &#xE9; o mais f&#xE1;cil; e o terceiro, por experi&#xEA;ncia, que &#xE9; o mais amargo.&#x201D; - Conf&#xFA;cio</p>
</blockquote>
</div>
<p>Essa passagem de Conf&#xFA;cio deixa claro que n&#xE3;o existe s&#xF3; um jeito de se aprender, com um mix de maneiras de se obter conhecimento fica um pouco menos dif&#xED;cil encontrar a sabedoria: estudar, exercitar e praticar se torna divertido quando se trata de programar em R!</p>
</div> </div> <footer> </footer> </article> <article class="post"> <a href="https://disqus.com/" class="dsq-brlink">comments powered by </a> </article> </p>
