<div><p>Esse paper &#xE9;, para mim, o melhor artigo do Hadley. A primeira frase da defini&#xE7;&#xE3;o cita Tolstoy e diz:</p><blockquote>
<p>Like families, tidy datasets are all alike but every messy dataset is messy in its own way.</p>
</blockquote><p>Essa frase resume a vida de qualquer um que trabalha ou j&#xE1; trabalhou com an&#xE1;lise de dados. O ponto mais importante do que significa <em>tidy data</em> tamb&#xE9;m est&#xE1; neste primeiro par&#xE1;grafo: s&#xE3;o datasets em que a estrutura dos dados est&#xE1; ligada padronizadamente com o seu significado. A forma padronizada &#xE9;:</p><p>O exemplo c&#xE1;ssico &#xE9; o seguinte. Primeiro vamos ver um banco de dados <em>desarrumado</em>.</p><p>Esse dataset est&#xE1; <em>desarrumado</em> pois existem duas colunas <strong>Idh2015</strong> e <strong>Idh2014</strong> que representam a mesma vari&#xE1;vel: <strong>IDH</strong> e uma vari&#xE1;vel impl&#xED;cita <strong>ANO</strong>, que tamb&#xE9;m aparece nesta duas colunas. A forma <em>tidy</em> de representar este dataset seria:</p><div id="o-que-isso-tem-a-ver-com" class="section level2"> <p>&#x2026; teste t-pareado ou com modelos mistos?</p>
<p>Suponha que queremos inferir se houve alguma mudan&#xE7;a na m&#xE9;dia do IDH de um ano para o outro. Ou seja testar se a m&#xE9;dia do IDH de 2015 &#xE9; diferente da m&#xE9;dia do IDH de 2014. Vamos considerar um banco de dados simulado:</p>
<pre class="r"><code>set.seed(10201)
library(tidyverse)
df &lt;- data_frame( Pais = paste0(&quot;pais&quot;, 1:50), Idh2014 = runif(50), Idh2015 = Idh2014 + rnorm(50, mean = 0.1, sd = 0.025)
)</code></pre>
<p>Uma forma de fazer isso &#xE9; usar o teste t pareado que &#xE9; ensinado nos cursos introdut&#xF3;rios de estat&#xED;stica. Basicamente o que ele faz &#xE9; testar se a m&#xE9;dia da diferen&#xE7;a entre o IDH2015 e o IDH 2014 &#xE9; diferente de zero. Isso &#xE9; diferente de um teste T usual, pois o teste t pareado ajusta o seu c&#xE1;lculo da vari&#xE2;ncia para considerar que existem duas fontes de incerteza.</p>
<p>No R a forma mais natural de fazer isso &#xE9;:</p>
<pre class="r"><code>teste &lt;- t.test(df$Idh2015, df$Idh2014, paired=TRUE)</code></pre>
<p>Note que o nosso banco de dados est&#xE1; <em>desarrumado</em> e mesmo assim foi muito simples fazer esse teste no R. Agora vamos arrumar o banco de dados.</p>
<pre class="r"><code>df &lt;- df %&gt;% gather(ano, idh, -Pais) %&gt;% mutate(ano = parse_number(ano))</code></pre>
<p>Agora para fazer o mesmo teste, poder&#xED;amos filtrar o banco de dados duas vezes, por exemplo:</p>
<pre class="r"><code>t.test(df$idh[df$ano == 2015], df$idh[df$ano == 2014], paired = TRUE)</code></pre>
<pre><code>## ## Paired t-test
## ## data: df$idh[df$ano == 2015] and df$idh[df$ano == 2014]
## t = 27.355, df = 49, p-value &lt; 2.2e-16
## alternative hypothesis: true difference in means is not equal to 0
## 95 percent confidence interval:
## 0.09000554 0.10427822
## sample estimates:
## mean of the differences ## 0.09714188</code></pre>
<p>Mas a&#xED; estamos voltando para a forma desarrumada para fazer o teste. Outra forma de fazer &#xE9; considerar essa compara&#xE7;&#xE3;o de m&#xE9;dias como um problema de regress&#xE3;o em que a suposi&#xE7;&#xE3;o independ&#xEA;ncia das observa&#xE7;&#xF5;es n&#xE3;o &#xE9; v&#xE1;lida, uma vez que dado um pais, com certeza existe rela&#xE7;&#xE3;o entre o idh de 2014 e de 2015.</p>
<p>Vamos ajustar um modelo com efeitos aleat&#xF3;rios para esse problema e comparar os resultados.</p>
<pre class="r"><code>library(nlme)
model &lt;- lme(idh ~ as.factor(ano), random = ~1|Pais, data = df)
summary(model)</code></pre>
<pre><code>## Linear mixed-effects model fit by REML
## Data: df ## AIC BIC logLik
## -184.7518 -174.4119 96.37588
## ## Random effects:
## Formula: ~1 | Pais
## (Intercept) Residual
## StdDev: 0.3009017 0.01775584
## ## Fixed effects: idh ~ as.factor(ano) ## Value Std.Error DF t-value p-value
## (Intercept) 0.4840132 0.04262795 49 11.35436 0
## as.factor(ano)2015 0.0971419 0.00355117 49 27.35491 0
## Correlation: ## (Intr)
## as.factor(ano)2015 -0.042
## ## Standardized Within-Group Residuals:
## Min Q1 Med Q3 Max ## -1.88877770 -0.44544521 -0.01239249 0.39934207 1.84475543 ## ## Number of Observations: 100
## Number of Groups: 50</code></pre>
<p>Estamos interessados em comparar a signific&#xE2;ncia do efeito fixo da vari&#xE1;vel ano nesse modelo com a do teste t-pareado. Veja que no caso a estat&#xED;stica T do testes &#xE9; id&#xEA;ntica: 27.35.</p>
<p>Vimos que a forma como os dados est&#xE3;o estruturados no seu banco de dados pode influenciar a t&#xE9;cnica utilizada para a sua an&#xE1;lise. Se ele estivesse na forma <em>desarrumada</em> o mais natural seria aplicar um teste t pareado, se ele estivesse em formado <em>tidy</em> o natural seria usar um modelo misto. No seu paper, Hadley argumenta que a maioria dos softwares esperam que o seu banco de dados esteja <em>arrumado</em> no sentido de que cada vari&#xE1;vel &#xE9; uma coluna e cada observa&#xE7;&#xE3;o &#xE9; uma linha.</p>
</div></div>
