<div><p class="text-muted text-uppercase mb-small text-right"> Por <a href="http://curso-r.com/author/william">William</a> 09/12/2017 </p><div id="post-content"> <p>N&#xE3;o importa a &#xE1;rea de atua&#xE7;&#xE3;o, a maior parte do dia do estat&#xED;stico &#xE9; atr&#xE1;s do computador. E desse tempo, a maior parte &#xE9; atr&#xE1;s de um (geralmente &#xFA;nico) programa estat&#xED;stico.</p>
<p>Os principais programas hoje em dia permitem a execu&#xE7;&#xE3;o das etapas essenciais de uma an&#xE1;lise: intera&#xE7;&#xE3;o com banco de dados, transforma&#xE7;&#xE3;o, cria&#xE7;&#xE3;o de visualiza&#xE7;&#xF5;es e modelagem. Alguns v&#xE3;o al&#xE9;m e auxiliam na comunica&#xE7;&#xE3;o dos resultados. Tamb&#xE9;m &#xE9; comum a exist&#xEA;ncia de ambientes de programa&#xE7;&#xE3;o, mesmo quando o programa &#xE9; bem estruturado no <em>point and click</em>.</p>
<p>Eu considero a programa&#xE7;&#xE3;o primordial para um estat&#xED;stico. Ela nos d&#xE1; a liberdade para sermos criativos, para n&#xE3;o nos limitarmos em t&#xE9;cnicas que algu&#xE9;m criou e todo mundo usa. Para mim, um estat&#xED;stico que n&#xE3;o sabe/gosta de programar &#xE9; igual a um piloto que s&#xF3; dirige carro autom&#xE1;tico.</p>
<p>&#xC9; por isso que o R &#xE9; uma ferramenta t&#xE3;o incr&#xED;vel para se trabalhar. Ele pega a sua m&#xE3;o no momento em que voc&#xEA; recebe a base de dados, estando ela arrumada ou n&#xE3;o, e s&#xF3; solta depois da sua an&#xE1;lise estar devidamente divulgada. Para cada problema, o R te fornece todas as pe&#xE7;as e te deixa montar do jeito que quiser. E mesmo quando uma pe&#xE7;a n&#xE3;o existe, voc&#xEA; mesmo pode cri&#xE1;-la ou pedir socorro para a comunidade mais que fant&#xE1;stica de erreiros pelo mundo.</p>
<p>Claro que aprender a programar &#xE9; bem custoso. Para quem nunca foi familiar com a computa&#xE7;&#xE3;o, vai ser um caminho bem tortuoso no in&#xED;cio. Mas como discutimos no &#xFA;ltimo post, n&#xE3;o existe aprendizado de gra&#xE7;a, e por mais que voc&#xEA; n&#xE3;o goste de estudar programa&#xE7;&#xE3;o, &#xE9; um investimento com retorno mais do que garantido.</p>
<p>Assim, encerro essa s&#xE9;rie de discuss&#xF5;es. Fazendo um resum&#xE3;o do que falamos at&#xE9; aqui, podemos enumerar os seguintes itens:</p>
<ul>
<li><p>A Estat&#xED;stica &#xE9; uma disciplina fant&#xE1;stica, principalmente para quem gosta de aprender, e o mercado est&#xE1; bombando.</p></li>
<li><p>Aprender Estat&#xED;stica &#xE9; dif&#xED;cil, assim como todo conhecimento. O que vai limitar a sua capacidade de aprender &#xE9; o quanto voc&#xEA; vai conseguir dominar a sua pregui&#xE7;a de estudar.</p></li>
<li><p>A Estat&#xED;stica e a programa&#xE7;&#xE3;o andam lado a lado. O Estat&#xED;stico que sabe programar tem muito mais poder para resolver problemas complicados.</p></li>
<li><p>O R &#xE9; o ambiente mais legal para trabalhar com Estat&#xED;stica. :D</p></li>
</ul>
<p>&#xC9; isso! Espero que possamos continuar discutindo o quanto &#xE9; legal trabalhar com Estat&#xED;stica e que cada vez mais pessoas se interessem por esse caminho dif&#xED;cil, mas recompensador.</p> </div></div>
