<div><p class="text-muted text-uppercase mb-small text-right"> Por <a href="http://curso-r.com/author/william">William</a> 11/11/2017 </p><div id="post-content"> <p>Volta e meia eu escuto as famosas frases</p>
<pre class="r"><code>paste(&quot;Eu sou de&quot;, c(&quot;Humanas&quot;, &quot;Exatas&quot;, &quot;Biol&#xF3;gicas&quot;))</code></pre>
<pre><code>## [1] &quot;Eu sou de Humanas&quot; &quot;Eu sou de Exatas&quot; &quot;Eu sou de Biol&#xF3;gicas&quot;</code></pre>
<p>de algu&#xE9;m tentando justificar por que n&#xE3;o vai fazer alguma coisa.</p>
<p>Muitas vezes, n&#xE3;o passa de uma brincadeira na hora de dividir a conta do bar. Muitas outras, me soa como uma desculpa pronta para n&#xE3;o encarar problemas complicados. Para mim, todo aprendizado &#xE9; dif&#xED;cil, n&#xE3;o acho que existe conhecimento de gra&#xE7;a, ent&#xE3;o realmente importa se ele &#xE9; de Humanas, Exatas ou Biol&#xF3;gicas?</p>
<p>A divis&#xE3;o do conhecimento nessas tr&#xEA;s grandes &#xE1;reas tem a sua import&#xE2;ncia organizacional, mas acaba motivando muita gente a criar limita&#xE7;&#xF5;es que n&#xE3;o existem de verdade. Por que algu&#xE9;m de Exatas n&#xE3;o conseguiria assimilar as ideias de um texto filos&#xF3;fico? Ou por que algu&#xE9;m de Biol&#xF3;gicas n&#xE3;o conseguiria aprender C&#xE1;lculo?</p>
<p>Acredito que cada um de n&#xF3;s tem afinidade por uma das &#xE1;reas e maior facilidade em estudar um t&#xF3;pico ou outro. Normal. Mas fico triste quando vejo pessoas inteligentes se diminuindo ao se declararem incapazes de aprender outras compet&#xEA;ncias que n&#xE3;o a delas. Sei que essa incapacidade n&#xE3;o existe e enxergo apenas como uma forma sofisticada de dizer &#x201C;Estou com pregui&#xE7;a&#x201D;.</p>
<p>Uma das belezas da Estat&#xED;stica &#xE9; nos fazer perder esse preconceito. Por mais que tenhamos nossos gostos, descobrimos que n&#xE3;o estamos presos ao dom&#xED;nio de apenas uma &#xE1;rea. N&#xF3;s trabalhamos com pessoas que pensam e aprendem de formas diferentes de nossa e constru&#xED;mos juntos pontes para trocarmos conhecimento. Ser estat&#xED;stico &#xE9; n&#xE3;o ter medo de estudar, seja l&#xE1; o que for.</p>
<p>Trazendo a reflex&#xE3;o aqui para o nosso mundinho, j&#xE1; ouvi muitas vezes colegas dizendo, principalmente na Gradua&#xE7;&#xE3;o, que n&#xE3;o usam o R porque ele &#xE9; dif&#xED;cil ou porque n&#xE3;o gostam de programar. A minha opini&#xE3;o sobre a primeira desculpa est&#xE1; nos par&#xE1;grafos acima. Sobre a segunda, vou discutir no pr&#xF3;ximo e &#xFA;ltimo post desta s&#xE9;rie: a rela&#xE7;&#xE3;o entre Estat&#xED;stica e programa&#xE7;&#xE3;o.</p>
<p>Resumindo a &#xF3;pera: sempre vamos apanhar aprendendo, e vamos apanhar mais ainda quando n&#xE3;o gostamos do que estamos estudando, mas cedo ou tarde, com a quantidade certa de esfor&#xE7;o, o conhecimento d&#xE1; as caras.</p>
<p>E no bar, na hora de dividir a conta, o problema n&#xE3;o &#xE9; voc&#xEA; ser de Humanas. O problema &#xE9; a sua pregui&#xE7;a. :D</p> </div></div>
