<div><p class="text-muted text-uppercase mb-small text-right"> Por <a href="http://curso-r.com/author/caio">Caio</a> 13/11/2017 </p><div id="post-content"> <p>Nem sempre os dados que precisamos para uma an&#xE1;lise podem ser encontrados em uma base consolidada. Muitas vezes as informa&#xE7;&#xF5;es que queremos n&#xE3;o est&#xE3;o imediatamente dispon&#xED;veis e precisam ser coletadas com o tempo atrav&#xE9;s de um processo lento e mon&#xF3;tono.</p>
<p>Imagine, por exemplo, que quis&#xE9;ssemos baixar os dados meteorol&#xF3;gicos das maiores cidades do mundo a cada 12 horas para uma an&#xE1;lise sobre previs&#xF5;es do tempo. Um programador desavisado talvez criasse alarmes em seu rel&#xF3;gio e para baixar as tabelas necess&#xE1;rias quando eles tocassem.</p>
<p>Mas isso n&#xE3;o parece uma boa estrat&#xE9;gia, certo?</p>
<div id="darksky" class="section level2"> <p>Para demonstrar uma alternativa a este m&#xE9;todo, vamos usar um servi&#xE7;o de previs&#xF5;es do tempo chamado <a href="https://darksky.net/">DarkSky</a>. Esta plataforma ficou conhecida recentemente pela sua precis&#xE3;o incr&#xED;vel e pelo seu <a href="https://play.google.com/store/apps/details?id=net.darksky.darksky&amp;hl=en">aplicativo</a> extremamente bem feito, mas uma coisa que poucos sabem &#xE9; que a DarkSky tamb&#xE9;m disponibiliza uma API para qualquer um interessado em dados meteorol&#xF3;gicos.</p>
<p>Para a nossa sorte, o <a href="https://github.com/hrbrmstr">hrbrmstr</a> j&#xE1; criou uma <a href="https://github.com/hrbrmstr/darksky">interface em R</a> para essa API que pode ser instalada facilmente com o comando abaixo:</p>
<pre class="r"><code># install.packages(&quot;devtools&quot;)
devtools::install_github(&quot;hrbrmstr/darksky&quot;)</code></pre>
<p>Depois de instalado o pacote, v&#xE1; para o <a href="https://darksky.net/dev">portal do desenvolvedor</a> da DarkSky, crie uma conta e obtenha uma chave secreta para acessar a API.</p>
<pre class="r"><code>Sys.setenv(DARKSKY_API_KEY = &quot;SUA CHAVE SECRETA&quot;)</code></pre>
</div>
<div id="baixando-os-dados" class="section level2"> <p>O primeiro passo da nossa an&#xE1;lise &#xE9; determinar as latitudes e longitudes das maiores cidades do mundo para que possamos pedir as previs&#xF5;es do tempo destas coordenadas.</p>
<p>Com o pacote <code>maps</code> podemos fazer isso de uma maneira bastante simples:</p>
<pre class="r"><code>forecasts &lt;- maps::world.cities %&gt;% dplyr::as_tibble() %&gt;% dplyr::filter(pop &gt; 2000000) %&gt;% dplyr::rename(country = country.etc) %&gt;% dplyr::select(name, country, lat, long) %&gt;% dplyr::mutate( currently = list(&quot;&quot;), hourly = list(&quot;&quot;), daily = list(&quot;&quot;))</code></pre>
<p>No trecho de c&#xF3;digo acima pegamos todas as cidades com mais de 2 milh&#xF5;es de habitantes (juntamente com suas localiza&#xE7;&#xF5;es) da base <code>maps::world.cities</code>. As &#xFA;ltimas 4 linhas s&#xE3;o uma prepara&#xE7;&#xE3;o para a obten&#xE7;&#xE3;o das previs&#xF5;es do tempo que faremos logo a seguir:</p>
<pre class="r"><code>for (i in 1:nrow(forecasts)) { forecast &lt;- darksky::get_current_forecast(forecasts$lat[i], forecasts$long[i]) forecasts$currently[i] &lt;- forecast$currently %&gt;% dplyr::as_tibble() %&gt;% list() forecasts$hourly[i] &lt;- forecast$hourly %&gt;% dplyr::as_tibble() %&gt;% list() forecasts$daily[i] &lt;- forecast$daily %&gt;% dplyr::as_tibble() %&gt;% list()
}</code></pre>
<p>Na coluna <code>currently</code> guardamos o estado meteorol&#xF3;gico atual da cidade, enquanto em <code>hourly</code> e <code>daily</code> colocamos as previs&#xF5;es do tempo para as pr&#xF3;ximas 48 horas e para os pr&#xF3;ximos 7 dias respectivamente. Agora s&#xF3; resta salvar isso tudo em um arquivo RDS:</p>
<pre class="r"><code>file &lt;- lubridate::now() %&gt;% lubridate::ymd_hms() %&gt;% as.character() %&gt;% stringr::str_replace_all(&quot;[-: ]&quot;, &quot;_&quot;) %&gt;% stringr::str_c(&quot;.rds&quot;)&#xA0; readr::write_rds(forecasts, stringr::str_c(&quot;DIRET&#xD3;RIO DOS ARQUIVOS&quot;, file))</code></pre>
</div>
<div id="cronr" class="section level2"> <p>Perceba que o script descrito na se&#xE7;&#xE3;o anterior n&#xE3;o depende de nenhum input do programador e pode ser rodado automaticamente. Agora s&#xF3; nos resta automatizar essa execu&#xE7;&#xE3;o, tarefa que realizaremos com o pacote <code>cronR</code>. Ele funciona nas plataformas Mac e Linux e pode ser instalado com o comando a seguir:</p>
<pre class="r"><code>install.packages(&quot;cronR&quot;)</code></pre>
<p>Esse pacote nos permite agendar a execu&#xE7;&#xE3;o de qualquer comando para que ela ocorra a cada tantos minutos/horas/dias/&#x2026; Certifique-se de que voc&#xEA; est&#xE1; em uma m&#xE1;quina ou servidor que n&#xE3;o ser&#xE1; desligado, <a href="https://en.wikipedia.org/wiki/Cron">verifique se o cron daemon est&#xE1; ativo</a> e agende a execu&#xE7;&#xE3;o do nosso script:</p>
<pre class="r"><code>cmd &lt;- cronR::cron_rscript(&quot;CAMINHO PARA SCRIPT&quot;) cronR::cron_add(cmd, &quot;daily&quot;, &quot;12AM&quot;)
cronR::cron_add(cmd, &quot;daily&quot;, &quot;12PM&quot;)</code></pre>
<p>E isso &#xE9; tudo! No meu caso, agendei o script para executar diariamente &#xE0;s 00:00 e &#xE0;s 12:00, mas a frequ&#xEA;ncia das chamadas fica a seu crit&#xE9;rio (lembrando apenas que o plano gratuito da API do DarkSky s&#xF3; permite 1000 chamadas por dia). Para saber mais sobre como mudar a frequ&#xEA;ncia das execu&#xE7;&#xF5;es, consulte a <a href="https://github.com/bnosac/cronR">documenta&#xE7;&#xE3;o do cronR</a>.</p>
</div>
<div id="conclusao" class="section level2"> <p>Como vimos, n&#xE3;o &#xE9; dif&#xED;cil agendar a execu&#xE7;&#xE3;o de um script. A maior parte do nosso trabalho &#xE9; criar um c&#xF3;digo que funcione independentemente do programador (por exemplo nomeando os arquivos gerados automaticamente), mas depois disso &#xE9; s&#xF3; chamar <code>cronR::cron_rscript()</code> e <code>cronR::cron_add()</code>.</p>
<p>No meu pr&#xF3;ximo post usarei os dados baixados com esse tutorial para uma an&#xE1;lise sobre previs&#xF5;es meteorol&#xF3;gicas, ent&#xE3;o fique ligado na parte dois!</p>
<p>P.S.: Se voc&#xEA; quiser o c&#xF3;digo completo do meu arquivo <code>get_forecasts.R</code>, disponibilizei ele como <a href="https://gist.github.com/ctlente/997f603f05883fcda573d96e310dad69">um Gist</a>. Al&#xE9;m disso, tamb&#xE9;m disponibilizei uma vers&#xE3;o em ingl&#xEA;s deste post no <a href="http://ctlente.com/en/cloudy-cronr/">meu blog pessoal</a>. Abra&#xE7;os!</p>
</div> </div></div>
