<div id="post-content"> <blockquote>
<p>Se voc&#xEA; tamb&#xE9;m quiser escrever um post como convidada, entre em contato a gente em <a href="mailto:contato@curso-r.com">contato@curso-r.com</a>!</p>
</blockquote>
<div id="pacote-reticulate" class="section level2"> <p>Imagine se voc&#xEA; pudesse aproveitar da quantidade e da variedade enorme de m&#xF3;dulos e bibliotecas do Python no ambiente amig&#xE1;vel do RStudio? Gra&#xE7;as ao pacote <a href="https://rstudio.github.io/reticulate/"><code>reticulate</code></a> isso &#xE9; poss&#xED;vel de uma maneira familiar para quem quem j&#xE1; &#xE9; usu&#xE1;rio do R.</p>
<p>O <code>reticulate</code> &#xE9; um pacote que proporciona a integra&#xE7;&#xE3;o Python &amp; R via R e pode ser bastante &#xFA;til se voc&#xEA; quiser fazer todas as an&#xE1;lises no ambiente do Rstudio. Os m&#xF3;dulos, classes e fun&#xE7;&#xF5;es do Python importados podem ser utilizados como se fossem fun&#xE7;&#xF5;es nativas do R.</p>
<p>Para utilizar o pacote s&#xE3;o necess&#xE1;rias a instala&#xE7;&#xE3;o do Python com vers&#xE3;o superior a 2.7, a instala&#xE7;&#xE3;o dos m&#xF3;dulos do Python que ser&#xE3;o utilizados durante a an&#xE1;lise e a instala&#xE7;&#xE3;o do pacote via <code>install.packages()</code>.</p>
<pre class="r"><code># install.packages(&quot;reticulate&quot;)
library(reticulate)</code></pre>
<p>Quando for utilizada uma fun&#xE7;&#xE3;o do Python em um objeto do R, ele ser&#xE1; convertido para seu formato equivalente do Python e vice-versa. Os tipos de convers&#xF5;es de objetos s&#xE3;o explicitadas <a href="https://rstudio.github.io/reticulate/articles/introduction.html">neste link</a>.</p>
<pre class="r"><code>## Data frame do R &#xE9; convertido em Dict do Python
a &lt;- r_to_py(mtcars)
class(a)
## [1] &quot;python.builtin.dict&quot; &quot;python.builtin.object&quot; ## Dict do Python &#xE9; convertido em List do R
class(py_to_r(a))
## [1] &quot;list&quot;</code></pre>
</div>
<div id="importando-modulos" class="section level2"> <p>A importa&#xE7;&#xE3;o de m&#xF3;dulos do Python para o R &#xE9; bem simples. Basta usar a fun&#xE7;&#xE3;o <code>import()</code> do pacote <code>reticulate</code> e o nome do m&#xF3;dulo que voc&#xEA; quer importar, em seguida guardar isso em um objeto no R.</p>
<pre class="r"><code>np &lt;- import(&quot;numpy&quot;)
pandas &lt;- import(&quot;pandas&quot;)
os &lt;- import(&quot;os&quot;)</code></pre>
<p>Use a fun&#xE7;&#xE3;o <code>py_module_available()</code> pra checar se um m&#xF3;dulo do Python est&#xE1; dispon&#xED;vel no seu computador.</p>
<pre class="r"><code>py_module_available(&quot;matplotlib&quot;)
## [1] TRUE</code></pre>
<p>As fun&#xE7;&#xF5;es que est&#xE3;o dentro de m&#xF3;dulos ou classes do Python podem ser acessadas utilizando o operador <code>$</code>:</p>
<pre class="r"><code>os$getcwd()
## [1] &quot;/home/jtrecenti/curso-r/site/content/blog&quot;
np$abs(-1)
## [1] 1</code></pre>
<p>E podemos misturar fun&#xE7;&#xF5;es do R e do python:</p>
<pre class="r"><code>library(magrittr) rnorm(10) %&gt;% np$abs() %&gt;% np$cumproduct() %&gt;% plot()</code></pre>
<p><img src="http://curso-r.com/blog/2017-11-20-reticulate_files/figure-html/unnamed-chunk-6-1.png" width="672"></p>
</div>
<div id="exemplo" class="section level1"> <p>Para ilustrar a integra&#xE7;&#xE3;o Python &amp; R via R, vamos usar o Astropy, que &#xE9; uma biblioteca do Python desenvolvida para a astronomia. Vamos tentar reproduzir <a href="http://docs.astropy.org/en/stable/generated/examples/io/plot_fits-image.html#sphx-glr-generated-examples-io-plot-fits-image-py">esse exemplo que foi implementado no python</a>. Primeiro, precisamos instalar o m&#xF3;dulo:</p>
<pre><code>pip install astropy</code></pre>
<p>No ambiente do RStudio, vamos importar os m&#xF3;dulos do Astropy que usaremos.</p>
<pre class="r"><code>down &lt;- import(&quot;astropy.utils.data&quot;)
fits &lt;- import(&quot;astropy.io.fits&quot;)</code></pre>
<p>Em seguida, vamos baixar a imagem em arquivo FITS e verificar se est&#xE1; tudo ok usando a fun&#xE7;&#xE3;o info do Python que est&#xE1; no pacote Astropy.io.fits.</p>
<pre class="r"><code>url &lt;- &quot;https://astropy.stsci.edu/data/tutorials/FITS-images/HorseHead.fits&quot;
im.file &lt;- down$download_file(url, cache=TRUE)
fits$info(im.file)</code></pre>
<pre><code>Filename: ~/.astropy/cache/download/py2/2c9202ae878ecfcb60878ceb63837f5f
No. Name Ver Type Cards Dimensions Format 0 PRIMARY 1 PrimaryHDU 161 (891, 893) int16 1 er.mask 1 TableHDU 25 1600R x 4C [F6.2, F6.2, F6.2, F6.2]</code></pre>
<p>Agora vamos transformar nossa imagem em uma matriz de pixels e plotar com a fun&#xE7;&#xE3;o image do R.</p>
<pre class="r"><code>im.data &lt;- fits$getdata(im.file)
im.data %&gt;% t() %&gt;% image(col = gray(seq(0, 1, length = 256)))</code></pre>
<p><img src="http://curso-r.com/blog/2017-11-20-reticulate_files/figure-html/unnamed-chunk-9-1.png" width="672"></p>
</div> </div>
