<div><p class="text-muted text-uppercase mb-small text-right"> Por <a href="http://curso-r.com/author/daniel">Daniel</a> 05/03/2018 </p><div id="post-content"> <p>Existem diversas formas de hospedar o seu app feito <a href="https://shiny.rstudio.com/">em shiny</a>. A maneira mais simples &#xE9; usando o <a href="http://www.shinyapps.io/">shinyapps.io</a>, SaaS desenvolvido pela pr&#xF3;pria RStudio. No entanto, na vers&#xE3;o Free o seu app fica com um logotipo do RStudio no canto e n&#xE3;o &#xE9; permitido configurar um dom&#xED;nio pr&#xF3;prio, ou seja, a url do seu app sempre vai ser algo do tipo: <code>dfalbel.shinyapps.io/meuapp</code>.</p>
<p>Uma alternativa gratuita e que n&#xE3;o possui essas contra-partidas &#xE9; usar o servi&#xE7;o <a href="https://zeit.co/now">now.sh</a>. O <a href="https://zeit.co/now">now</a>, originalmente, foi desenvolvido para hospedar aplicativos feitos em nodejs e javascript, mas recentemente eles possibilitaram a hospedagem de aplicativos feitos com <a href="https://www.docker.com/">Docker</a>.</p>
<p>&#xC9; dif&#xED;cil explicar o que &#xE9; o <a href="https://www.docker.com/">Docker</a> em poucas palavras, mas ele &#xE9; uma plataforma de containers que facilita a configura&#xE7;&#xE3;o e prepara&#xE7;&#xE3;o do ambiente para a hospedagem de um app. Em outras palavras, voc&#xEA; escreve em um arquivo chamado <code>Dockerfile</code> especificando como voc&#xEA; quer que seja o ambiente, o que voc&#xEA; precisa instalar, que arquivos voc&#xEA; quer colocar l&#xE1; dentro. Para este tutorial voc&#xEA; s&#xF3; precisar&#xE1; fazer pequenas modifica&#xE7;&#xF5;es no <code>Dockerfile</code> e n&#xE3;o precisar&#xE1; entender profundamente como ele funciona.</p>
<section id="instalacao" class="level3"> <p>Para seguir o tutorial voc&#xEA; precisa instalar o <a href="https://zeit.co/now">now</a> e criar uma conta. Siga <a href="https://zeit.co/download">este link</a> para instala&#xE7;&#xE3;o e configura&#xE7;&#xE3;o do <a href="https://zeit.co/now">now</a>.</p>
</section>
<section id="estrutura-do-projeto" class="level3"> <p><a href="https://github.com/curso-r/shiny-now">Esse reposit&#xF3;rio</a> cont&#xE9;m um exemplo simples funcionando do que iremos detalhar agora. Crie uma pasta no seu computador ou um projeto no RStudio com a seguinte estrutura:</p>
<pre><code>-- app/
-- -- app.R
-- Dockerfile</code></pre>
</section>
<section id="dockerfile" class="level3"> <p><code>Dockerfile</code> &#xE9; um arquivo de texto vazio por enquanto. Dentro da pasta <code>app</code> coloque o seu app shiny. No meu exemplo coloquei um shiny com apenas umarquivo <code>app.R</code>, mas nada impede voc&#xEA; de colocar um shiny com a estrtura mais comum (um arquivo <code>ui.R</code> e um arquivo <code>server.R</code>).</p>
</section>
<section id="dockerfile-1" class="level3"> <p><code>Dockerfile</code>s podem ser referenciados a outras imagens docker. Existe uma imagem chamada <a href="https://hub.docker.com/r/rocker/shiny/">rocker/shiny</a> que j&#xE1; deixa quase tudo preparado para hospedar um app shiny, por isso em nosso Dockerfile vamos incluir a linha:</p>
<pre><code>FROM rocker/shiny</code></pre>
<p>Em seguida vamos indicar as instru&#xE7;&#xF5;es para instala&#xE7;&#xE3;o dos pacotes do R que s&#xE3;o usados no shiny. No meu caso, como o app n&#xE3;o faz praticamente nada, s&#xF3; usei o pacote <code>shinydashboard</code> por isso a pr&#xF3;xima linha do meu <code>Dockerfile</code> &#xE9; apenas:</p>
<pre><code>RUN R -e &quot;install.packages(c(&apos;shinydashboard&apos;), repos=&apos;https://cran.rstudio.com/&apos;)&quot;</code></pre>
<p>Se voc&#xEA; precisar instalar mais pacotes basta colocar o nome deles no comando acima, por exemplo:</p>
<pre><code>RUN R -e &quot;install.packages(c(&apos;shinydashboard&apos;, &apos;tidyverse&apos;), repos=&apos;https://cran.rstudio.com/&apos;)&quot;</code></pre>
<p>Feito isso, o pr&#xF3;ximo comando do <code>Dockerfile</code> &#xE9; o <code>COPY</code> que serve para indicar para o <a href="https://www.docker.com/">Docker</a> quais arquivos da pasta devem ser copiados para dentro do ambiente de hospedagem e para qual pasta dentro do novo ambiente eles devem copiados. No nosso caso, queremos copiar a pasta <code>app</code> para dentro da pasta <code>/srv/shiny-server/</code> (que &#xE9; por padr&#xE3;o a pasta em que o Shiny Server procura por apps). Para fazer isso, adicionamos a linha:</p>
<pre><code>COPY /app/ /srv/shiny-server/</code></pre>
<p>No final, o nosso <code>Dockerfile</code> cont&#xE9;m apenas 3 linhas:</p>
<pre><code>FROM rocker/shiny
RUN R -e &quot;install.packages(c(&apos;shinydashboard&apos;), repos=&apos;https://cran.rstudio.com/&apos;)&quot;
COPY /app/ /srv/shiny-server/</code></pre>
</section>
<section id="app" class="level3"> <p>Dentro da pasta app, coloque o seu c&#xF3;digo shiny. A princ&#xED;pio, voc&#xEA; n&#xE3;o precisa fazer nenhuma modifica&#xE7;&#xE3;o. No meu exemplo, coloquei o arquivo <code>app.R</code> contendo um aplicativo usando o <a href="https://rstudio.github.io/shinydashboard/get_started.html"><code>shinydashboard</code> (copiado da documenta&#xE7;&#xE3;o do pacote)</a>.</p>
<p>O conte&#xFA;do do arquivo do arquivo <code>app.R</code> est&#xE1; abaixo:</p>
<pre><code>library(shinydashboard) ui &lt;- dashboardPage( dashboardHeader(title = &quot;Basic dashboard&quot;), dashboardSidebar(), dashboardBody( # Boxes need to be put in a row (or column) fluidRow( box(plotOutput(&quot;plot1&quot;, height = 250)), box( title = &quot;Controls&quot;, sliderInput(&quot;slider&quot;, &quot;Number of observations:&quot;, 1, 100, 50) ) ) )
) server &lt;- function(input, output) { set.seed(122) histdata &lt;- rnorm(500) output$plot1 &lt;- renderPlot({ data &lt;- histdata[seq_len(input$slider)] hist(data) })
} shinyApp(ui, server)</code></pre>
</section>
<section id="chamando-o-now" class="level3"> <p>Se voc&#xEA; configurou o <a href="https://zeit.co/now">now</a> corretamente essa ser&#xE1; a parte mais f&#xE1;cil. Basta abrir um terminal e rodar <code>now</code>.</p>
<p>Ele vai soltar uma mensagem parecida com a abaixo:</p>
<pre><code>Daniels-MacBook-Air:shiny-now dfalbel$ now
&gt; Deploying ~/Documents/shiny-now under dfalbel@curso-r.com
&gt; Your deployment&apos;s code and logs will be publicly accessible because you are subscribed to the OSS plan.
&gt; &gt; NOTE: You can use `now --public` or upgrade your plan (https://zeit.co/account/plan) to skip this prompt
&gt; Ready! https://shiny-now-zoyrrtdqwv.now.sh (copied to clipboard) [5s]
&gt; Synced 1 file (131B) [5s]
&gt; Initializing&#x2026;
&gt; Building
&gt; &#x25B2; docker build
Sending build context to Docker daemon 6.656 kBkB
&gt; &#x25B2; Deploying image
&gt; &#x25B2; Container started
&gt; [2018-03-05T20:48:12.696] [INFO] shiny-server - Shiny Server v1.5.7.883 (Node.js v6.10.3)
&gt; [2018-03-05T20:48:12.701] [INFO] shiny-server - Using config file &quot;/etc/shiny-server/shiny-server.conf&quot;
&gt; [2018-03-05T20:48:12.780] [WARN] shiny-server - Running as root unnecessarily is a security risk! You could be running more securely as non-root.
&gt; [2018-03-05T20:48:12.788] [INFO] shiny-server - Starting listener on 0.0.0.0:3838
&gt; Deployment complete!</code></pre>
<p>Na sexta linha dessa mensagem, temos o endere&#xE7;o do nosso aplicativo. Por enquanto, o <a href="https://zeit.co/now">now</a> colocou um endere&#xE7;o para testes, mas tudo isso &#xE9; configur&#xE1;vel. Basta abrir essa url no navegador e ver o aplciativo funcionando.</p>
<p>Para mudar a url do seu app voc&#xEA; vai precisar usar o comando <code>now alias</code>. A documenta&#xE7;&#xE3;o desse comando &#xE9; muito boa e vai ser melhor do que qualquer coisa que eu escrever aqui. V&#xE1; para <a href="https://zeit.co/docs/features/aliases">este link</a>!</p>
</section>
<section id="conclusao" class="level3"> <p>O <a href="https://zeit.co/now">now</a> &#xE9; um servi&#xE7;o gratuito que permite a hospedagem de containers <a href="https://www.docker.com/">Docker</a>. Neste post configuramos um Dockerfile para instalar hospedar um app shiny e usando o comando <code>now</code> rapidamente enviamos o nosso aplicativo para o now e iniciamos a hospedagem.</p>
</section> </div></div>
