<div><p>A minha tese de doutorado envolve a an&#xE1;lise de dados de polui&#xE7;&#xE3;o do ar. Parte do trabalho est&#xE1; em encontrar bases de dados que exemplifiquem temas que eu precise discutir. Informa&#xE7;&#xF5;es sobre polui&#xE7;&#xE3;o do ar geralmente s&#xE3;o disponibilizados por &#xF3;rg&#xE3;os p&#xFA;blicos de monitoramento ambiental, o que deveria, por princ&#xED;pio, garantir a f&#xE1;cil acesso e a coleta eficiente dos dados. Como sabemos, nem sempre &#xE9; isso que acontece.</p><div id="qualar" class="section level1"> <p>O <a href="http://qualar.cetesb.sp.gov.br/qualar/home.do">Qualar</a> &#xE9; o sistema de informa&#xE7;&#xF5;es de qualidade do ar da CETESB. Por meio dele, podemos acessar os dados de todas as esta&#xE7;&#xF5;es de monitoramento do estado de S&#xE3;o Paulo. O sistema exige a cria&#xE7;&#xE3;o de um login e ent&#xE3;o o envio de um pequeno formul&#xE1;rio com quais informa&#xE7;&#xF5;es voc&#xEA; gostaria de visualizar.</p>
<p>O Qualar funciona muito bem para pequenas consultas, mas na extra&#xE7;&#xE3;o de uma massa grande de dados existem duas dificuldades:</p>
<ol>
<li><p>Se voc&#xEA; precisa de dados de v&#xE1;rias esta&#xE7;&#xF5;es e de v&#xE1;rios poluente, voc&#xEA; precisar&#xE1; repetir esse processo para cada combina&#xE7;&#xE3;o de esta&#xE7;&#xE3;o/poluente. Pegar todos os dados de oz&#xF4;nio da Grande S&#xE3;o Paulo, por exemplo, exigiria repetir a solicita&#xE7;&#xE3;o 23 vezes.</p></li>
<li><p>Como a planilha &#xE9; impressa na tela, se voc&#xEA; precisar de uma s&#xE9;rie muito longa, voc&#xEA; vai demorar bastante para carregar a p&#xE1;gina e seu computador corre um grande risco de travar no meio do caminho por falta de RAM.</p></li>
</ol>
<p>Para contornar este problema, vamos usar o R para construir um c&#xF3;digo que simule uma requisi&#xE7;&#xE3;o de dados ao Qualar. Em seguida, vamos transformar o c&#xF3;digo numa fun&#xE7;&#xE3;o para replicar o processo para diversos par&#xE2;metros rodando apenas algumas linhas de c&#xF3;digos.</p>
<p><strong>Observa&#xE7;&#xE3;o</strong>: o sistema tamb&#xE9;m tem uma op&#xE7;&#xE3;o &#x201C;Exportar dados Avan&#xE7;ado&#x201D;. Nela, &#xE9; poss&#xED;vel escolher at&#xE9; 3 par&#xE2;metros para cada esta&#xE7;&#xE3;o e os dados n&#xE3;o s&#xE3;o impressos na tela, sendo gerado diretamente um arquivo csv para download. Por&#xE9;m, com a desculpa de praticar a constru&#xE7;&#xE3;o do scraper, n&#xE3;o vamos usar essa op&#xE7;&#xE3;o.</p>
</div><div id="construindo-o-scraper" class="section level1"> <p>Para construir o scraper, vamos seguir os passos definidos <a href="http://curso-r.com/blog/2017/05/19/2017-05-19-scrapper-ssp/">neste post</a> da Curso-R escrito pelo <a href="https://github.com/azeloc">Fernando Corr&#xEA;a</a>. S&#xE3;o eles:</p>
<ol>
<li>Definir a p&#xE1;gina que voc&#xEA; quer raspar.</li>
<li>Identificar exatamente as requisi&#xE7;&#xF5;es que produzem o que voc&#xEA; quer.</li>
<li>Construir um programa que imite as requisi&#xE7;&#xF5;es que voc&#xEA; faria manualmente.</li>
<li>Repetir o passo (3) quantas vezes quiser.</li>
</ol>
<p>Um fluxo mais estruturado do web scraping &#xE9; discutido <a href="http://curso-r.com/blog/2018/02/18/2018-02-18-fluxo-scraping/">neste post</a> do <a href="https://github.com/ctlente/">Caio Lente</a>.</p>
<div id="passo-1" class="section level2"> <p>Para chegar na p&#xE1;gina que queremos raspar, precisamos passar pelas seguintes etapas dentro do Qualar: login, pesquisa e janela com os dados. Veja abaixo como prosseguir.</p>
<p><strong>Login</strong>: fazer o login <a href="http://qualar.cetesb.sp.gov.br/qualar/home.do">na p&#xE1;gina inicial</a>.</p>
<p><strong>Pesquisa</strong>: na pr&#xF3;xima p&#xE1;gina, acessar &#x201C;Consultas/Exportar Dados&#x201D; no menu da esquerda e preencher a pesquisa com os dados do par&#xE2;metro que voc&#xEA; quer acessar.</p>
<p><strong>Dados</strong>: na nova janela aberta pelo site est&#xE3;o os dados que queremos raspar.</p> </div>
<div id="passo-2" class="section level2"> <p>Para descobrir qual requisi&#xE7;&#xE3;o &#xE9; feita em cada momento, podemos utilizar o &#x201C;Inspect element&#x201D; do navegador. Eu estou usando o Firefox neste post, mas o procedimento &#xE9; semelhante em outros navegadores.</p>
<p>O login &#xE9; uma submiss&#xE3;o de formul&#xE1;rio. Inspecionando o html da p&#xE1;gina, podemos ver que os itens que o formul&#xE1;rio precisa enviar s&#xE3;o o &#x201C;cetesb_login&#x201D; e o &#x201C;cetesb_passoword&#x201D;.</p>
<p>Para descobrir que tipo de requisi&#xE7;&#xE3;o o login faz, basta abrir o Inspect element antes de fazer o login, logar no site e olhar a aba &#x201C;Network&#x201D;. A requisi&#xE7;&#xE3;o que queremos &#xE9; a &#x201C;autenticador&#x201D;. Ela faz uma requisi&#xE7;&#xE3;o POST para a url &#x201C;<a href="http://qualar.cetesb.sp.gov.br/qualar/autenticador" class="uri">http://qualar.cetesb.sp.gov.br/qualar/autenticador</a>&#x201D;.</p>
<p>N&#xE3;o vou mostrar aqui, mas a requisi&#xE7;&#xE3;o que a pesquisa faz para acessar os dados tamb&#xE9;m &#xE9; a submiss&#xE3;o de um formul&#xE1;rio e pode ser encontrada de forma equivalente.</p>
<p>Assim, para acessar os dados, precisaremos enviar outra requisi&#xE7;&#xE3;o POST, agora para a url &#x201C;<a href="http://qualar.cetesb.sp.gov.br/qualar/exportaDados.do" class="uri">http://qualar.cetesb.sp.gov.br/qualar/exportaDados.do</a>&#x201D;, contendo os itens desse novo formul&#xE1;rio, que s&#xE3;o as informa&#xE7;&#xF5;es que preencher&#xED;amos na pesquisa. No pr&#xF3;ximo passo, vai ficar mais claro o que estamos fazendo nessa etapa.</p>
</div>
<div id="passo-3" class="section level2"> <p>Vamos criar um c&#xF3;digo que imite essas requisi&#xE7;&#xF5;es.</p>
<p>Primeiro, como o sistema Qualar exige login, precisamos capturar o cookie do site para <em>manter a sess&#xE3;o logada</em> nas requisi&#xE7;&#xF5;es seguintes. O cookie da sess&#xE3;o &#xE9; guardado no objeto <code>my_cookie</code>, que ser&#xE1; passado em todas as requisi&#xE7;&#xF5;es.</p>
<pre class="r"><code>library(magrittr)
library(httr) res &lt;- GET(&quot;http://qualar.cetesb.sp.gov.br/qualar/home.do&quot;)
my_cookie &lt;- cookies(res)$value %&gt;% purrr::set_names(cookies(res)$name)</code></pre>
<p>Agora, precisamos enviar a requisi&#xE7;&#xE3;o POST para fazer o login e acessar o sistema.</p>
<ul>
<li><p>Os par&#xE2;metros do formul&#xE1;rio s&#xE3;o colocados dentro do argumento <code>body=</code> da fun&#xE7;&#xE3;o <code>POST()</code>. Se voc&#xEA; estiver replicando, basta substituir os valores <code>seu_login</code> e <code>sua_senha</code> pelo login e senha que voc&#xEA; obteve ao se cadastrar no Qualar.</p></li>
<li><p>O argumento <code>encode = &quot;form&quot;</code> especifica que a requisi&#xE7;&#xE3;o &#xE9; uma submiss&#xE3;o de formul&#xE1;rio.</p></li>
<li><p>O par&#xE2;metro <code>enviar = &quot;OK&quot;</code> indica que estamos submetendo o formul&#xE1;rio.</p></li>
<li><p>O cookie &#xE9; passado usando a fun&#xE7;&#xE3;o <code>set_cookies()</code>.</p></li>
</ul>
<pre class="r"><code>url &lt;- &quot;http://qualar.cetesb.sp.gov.br/qualar/autenticador&quot; res &lt;- POST( url, body = list( cetesb_login = &quot;seu_login&quot;, cetesb_password = &quot;sua_senha&quot;, enviar = &quot;OK&quot; ), encode = &quot;form&quot;, set_cookies(my_cookie)
)</code></pre>
<p>Ent&#xE3;o fazemos uma requisi&#xE7;&#xE3;o POST para acessar os dados. Essa requisi&#xE7;&#xE3;o imita a pesquisa dentro da p&#xE1;gina &#x201C;Exportar dados&#x201D;. Nela, precisamos definir quais dados queremos acessar.</p>
<pre class="r"><code>url &lt;- &quot;http://qualar.cetesb.sp.gov.br/qualar/exportaDados.do&quot; res &lt;- POST( url, query = list(method = &quot;pesquisar&quot;), body = list( irede = &quot;A&quot;, dataInicialStr = &quot;04/03/2018&quot;, dataFinalStr = &quot;05/03/2018&quot;, cDadosInvalidos = &quot;on&quot;, iTipoDado = &quot;P&quot;, estacaoVO.nestcaMonto = &quot;72&quot;, parametroVO.nparmt = &quot;63&quot; ), encode = &quot;form&quot;, set_cookies(my_cookie)
)</code></pre>
<p>Observe que, apesar de na pesquisa conseguirmos selecionar o nome da esta&#xE7;&#xE3;o e do par&#xE2;metro, a requisi&#xE7;&#xE3;o envia ids num&#xE9;ricos. No Qualar, eu encontrei apenas os ids das esta&#xE7;&#xF5;es, mas os valores de ambos os par&#xE2;metros podem ser encontrados inspecionando o html da p&#xE1;gina. Para facilitar a nossa vida, eu salvei esses valores nos arquivos <code>station_ids.csv</code> e <code>param_ids.csv</code>, que podem ser baixados pelo <a href="https://github.com/williamorim/Rpollution-blog/tree/master/content/blog/data">reposit&#xF3;rio do blog no Github</a>.</p>
<p>Para finalizar, precisamos ler o resultado da nossa requisi&#xE7;&#xE3;o e transformar a tabela existe no html em um data frame.</p>
<pre class="r"><code>content(res) %&gt;% rvest::html_table(fill = TRUE) %&gt;% extract2(2)</code></pre>
</div>
<div id="passo-4" class="section level2"> <p>Agora, vamos transformar nosso c&#xF3;digo numa fun&#xE7;&#xE3;o para poder repetir o processo v&#xE1;rias vezes para diversos par&#xE2;metros.</p>
<pre class="r"><code>scraper_CETESB &lt;- function(station, parameter, start, end, type = &quot;P&quot;, login, password, invalidData = &quot;on&quot;, network = &quot;A&quot;) { res &lt;- GET(&quot;http://qualar.cetesb.sp.gov.br/qualar/home.do&quot;) my_cookie &lt;- cookies(res)$value %&gt;% purrr::set_names(cookies(res)$name) url &lt;- &quot;http://qualar.cetesb.sp.gov.br/qualar/autenticador&quot; res &lt;- POST( url, body = list( cetesb_login = login, cetesb_password = password, enviar = &quot;OK&quot; ), encode = &quot;form&quot;, set_cookies(my_cookie) ) url &lt;- &quot;http://qualar.cetesb.sp.gov.br/qualar/exportaDados.do&quot; res &lt;- POST( url, query = list(method = &quot;pesquisar&quot;), body = list( irede = network, dataInicialStr = start, dataFinalStr = end, cDadosInvalidos = invalidData, iTipoDado = type, estacaoVO.nestcaMonto = station, parametroVO.nparmt = parameter ), encode = &quot;form&quot;, set_cookies(my_cookie) ) content(res) %&gt;% rvest::html_table(fill = TRUE) %&gt;% extract2(2) }</code></pre>
<p>Assim, basta rodar a fun&#xE7;&#xE3;o abaixo com o seu login e senha para obter em alguns segundos uma tabela com os dados solicitados. Veja um exemplo:</p>
<pre class="r"><code>dados_cetesb &lt;- scraper_CETESB(station = &quot;72&quot;, parameter = &quot;63&quot;, start = &quot;04/03/2018&quot;, end = &quot;05/03/2018&quot;, type = &quot;P&quot;, login = &quot;thewilliam89@gmail.com&quot;, password = &quot;wouldy0ukindly?&quot;, invalidData = &quot;on&quot;, network = &quot;A&quot;)</code></pre>
<p>Precisamos apenas tirar as colunas vazias e corrigir o nome das colunas.</p>
<pre class="r"><code>dados_cetesb &lt;- dados_cetesb %&gt;% janitor::remove_empty_cols() col_names &lt;- as.character(dados_cetesb[1,]) dados_cetesb &lt;- dados_cetesb %&gt;% magrittr::set_colnames(col_names) %&gt;% dplyr::slice(-1)</code></pre>
<p>Assim obtemos os dados que quer&#xED;amos:</p>
<pre class="r"><code>dados_cetesb %&gt;% dplyr::select(`Nome Esta&#xE7;&#xE3;o`:`M&#xE9;dia Hor&#xE1;ria`) %&gt;% head %&gt;% knitr::kable()</code></pre>
<table>
<thead> </thead>
<tbody>
<tr class="odd">
<td>Parque D.Pedro II</td>
<td>O3 (Oz&#xF4;nio)</td>
<td>&#xB5;g/m3</td>
<td>20</td>
</tr>
<tr class="even">
<td>Parque D.Pedro II</td>
<td>O3 (Oz&#xF4;nio)</td>
<td>&#xB5;g/m3</td>
<td>19</td>
</tr>
<tr class="odd">
<td>Parque D.Pedro II</td>
<td>O3 (Oz&#xF4;nio)</td>
<td>&#xB5;g/m3</td>
<td>18</td>
</tr>
<tr class="even">
<td>Parque D.Pedro II</td>
<td>O3 (Oz&#xF4;nio)</td>
<td>&#xB5;g/m3</td>
<td>12</td>
</tr>
<tr class="odd">
<td>Parque D.Pedro II</td>
<td>O3 (Oz&#xF4;nio)</td>
<td>&#xB5;g/m3</td>
<td>11</td>
</tr>
<tr class="even">
<td>Parque D.Pedro II</td>
<td>O3 (Oz&#xF4;nio)</td>
<td>&#xB5;g/m3</td>
<td>12</td>
</tr>
</tbody>
</table>
<p>Iterando essa fun&#xE7;&#xE3;o fica f&#xE1;cil repetir o processo para diversas esta&#xE7;&#xF5;es e par&#xE2;metros.</p>
<p>&#xC9; isso! D&#xFA;vidas, cr&#xED;ticas e sugest&#xF5;es, deixe um coment&#xE1;rio.</p>
<p>At&#xE9; a pr&#xF3;xima!</p>
</div>
</div></div>
