<div class="entry-content"> <p>A tecnologia Blockchain serve como uma plataforma que permite o tr&#xE2;nsito de informa&#xE7;&#xF5;es digitais sem o risco de serem copiadas. De certa forma, esta tecnologia estabeleceu um novo tipo de espa&#xE7;o na internet.</p>
<p>Blockchain, para definir em todos os aspectos, &#xE9; um tipo de algoritmo e estrutura de distribui&#xE7;&#xE3;o de dados para o gerenciamento de caixa eletr&#xF4;nico sem a interven&#xE7;&#xE3;o de qualquer administra&#xE7;&#xE3;o centralizada, programada para registrar todas as transa&#xE7;&#xF5;es financeiras, bem como tudo o que possui valor.</p>
<p>Projetado inicialmente para lidar com o Bitcoin, hoje o Blockchain ganha cada vez mais espa&#xE7;o e potencial para abrir novos caminha e inovar no processo de negocia&#xE7;&#xE3;o online. Por exemplo, em Dubai espera-se que at&#xE9; 2020 todos os documentos governamentais e transa&#xE7;&#xF5;es imobili&#xE1;rias estejam sendo arquivadas e processadas por Blockchain.</p>
<h2><strong><br>
Como a tecnologian Blockchain muda as Fintechs</strong></h2>
<p>Atualmente, as transa&#xE7;&#xF5;es digitais ocorrem com a ajuda de tokens. Este &#xE9; um c&#xF3;digo exclusivo gerado por um terceiro (como Visa ou Mastercard, por exemplo) e &#xE9; compartilhado com o solicitante de token (o revendedor do qual voc&#xEA; est&#xE1; comprando) e o emissor da conta (o banco do cliente).</p>
<p>Os tokens tornam as transa&#xE7;&#xF5;es on-line mais seguras ao esconder os dados reais de identifica&#xE7;&#xE3;o do cliente. Uma vez que o token &#xE9; gerado por um terceiro que, por si s&#xF3;, n&#xE3;o possui informa&#xE7;&#xF5;es sobre a transa&#xE7;&#xE3;o, n&#xE3;o h&#xE1; espa&#xE7;o para qualquer tipo de dados que possam ser utilizados por um cientista de dados.</p>
<p>Mas isso muda com a tecnologia Blockchain. Aqui, &#xE9; teoricamente poss&#xED;vel conseguir uma posse de todas as transa&#xE7;&#xF5;es que j&#xE1; aconteceram e isso fornece aos cientistas de dados tudo o que precisam para analisar tend&#xEA;ncias e padr&#xF5;es em transa&#xE7;&#xF5;es on-line.</p>
<p>Os Blockchains fornecem aos bancos e institui&#xE7;&#xF5;es financeiras a tecnologia necess&#xE1;ria para extrair dados mais &#xFA;teis do hist&#xF3;rico de transa&#xE7;&#xF5;es do cliente. Al&#xE9;m das institui&#xE7;&#xF5;es financeiras, os Blockchains como tecnologia tamb&#xE9;m t&#xEA;m casos de uso em v&#xE1;rias ind&#xFA;strias, onde &#xE9; poss&#xED;vel aos cientistas de dados &#x201C;cavarem&#x201D; atrav&#xE9;s de grandes quantidades de dados que estavam at&#xE9; agora indispon&#xED;veis para minera&#xE7;&#xE3;o.</p>
<p>Na imagem a seguir, criada pela <a href="https://www.ventureradar.com/">Venture Radar</a>, est&#xE3;o alguns exemplos de Startups que utilizam a tecnologia Blockchain:</p>
<p><img class="wp-image-465 size-full aligncenter" src="http://joseguilhermelopes.com.br/wp-content/uploads/2017/11/Blockchain-Image.png%20800w,%20http://joseguilhermelopes.com.br/wp-content/uploads/2017/11/Blockchain-Image-300x169.png%20300w,%20http://joseguilhermelopes.com.br/wp-content/uploads/2017/11/Blockchain-Image-768x432.png%20768w" alt="" width="800" srcset="http://joseguilhermelopes.com.br/wp-content/uploads/2017/11/Blockchain-Image.png 800w, http://joseguilhermelopes.com.br/wp-content/uploads/2017/11/Blockchain-Image-300x169.png 300w, http://joseguilhermelopes.com.br/wp-content/uploads/2017/11/Blockchain-Image-768x432.png 768w"></p>
<h2><strong><br>
Oportunidades para an&#xE1;lise de Big Data</strong></h2>
<p>Recentemente, <a href="http://www.businessinsider.com/ripple-progresses-blockchain-tech-high-profile-partners-2017-7">um cons&#xF3;rcio de 47 bancos japoneses se inscreveu com uma empresa chamada Ripple para permitir transfer&#xEA;ncias de dinheiro entre contas banc&#xE1;rias usando blockchain</a>. A principal raz&#xE3;o por tr&#xE1;s deste movimento era a de permitir transfer&#xEA;ncias em tempo real a um custo significativamente baixo.</p>
<p>Uma das raz&#xF5;es pelas quais as transfer&#xEA;ncias tradicionais em tempo real eram dispendiosas se dava por fatores de risco potenciais, como por exemplo uma falha de transa&#xE7;&#xE3;o onde o mesmo token de seguran&#xE7;a &#xE9; usado duas vezes. Com o Blockchain, esse risco &#xE9; amplamente evitado.</p>
<blockquote><p><strong>A an&#xE1;lise de dados oriundos de Blockchains permite identificar padr&#xF5;es como os gastos do consumidor e identificar transa&#xE7;&#xF5;es de risco muito mais r&#xE1;pidas do que podem ser feitas com a tecnologia atual. </strong></p></blockquote>
<p>Isso reduz o custo com as transa&#xE7;&#xF5;es em tempo real.</p>
<p>Atrav&#xE9;s do setor de sa&#xFA;de, varejo e administra&#xE7;&#xE3;o p&#xFA;blica, os estabelecimentos come&#xE7;aram a usar o Blockchain para evitar invas&#xF5;es e vazamentos de dados. Nos sistemas de sa&#xFA;de, uma tecnologia como Blockchain pode garantir que m&#xFA;ltiplas assinaturas sejam buscadas em todos os n&#xED;veis de acesso a dados. Isso pode impedir uma repeti&#xE7;&#xE3;o do <a href="https://www.forbes.com/sites/danmunro/2015/12/31/data-breaches-in-healthcare-total-over-112-million-records-in-2015/#6fdc12237b07">ataque de 2015 que levou ao roubo de mais de 100 milh&#xF5;es de registros de pacientes.</a></p>
<h2><strong><br>
Possibilidades de an&#xE1;lise em tempo real</strong></h2>
<p>At&#xE9; agora, a detec&#xE7;&#xE3;o de fraudes em tempo real era um sonho. Uma vez que o Blockchain tem um registro de banco de dados para cada transa&#xE7;&#xE3;o, ele fornece uma maneira para que as institui&#xE7;&#xF5;es verifiquem padr&#xF5;es em tempo real, se necess&#xE1;rio.</p>
<p>Empresas como <a href="https://www.chainalysis.com/">Chainalysis</a> e <a href="https://www.bloq.com/">Bloq</a>&#xA0;usam essa intelig&#xEA;ncia em tempo real para tomar decis&#xF5;es sobre dados pseud&#xF4;nimos.</p>
<p>Mas todas essas possibilidades tamb&#xE9;m levantam quest&#xF5;es sobre privacidade, e isso entra em contradi&#xE7;&#xE3;o direta com a raz&#xE3;o pela qual Blockchain e bitcoins tornaram-se populares em primeiro lugar. Entretanto, para analisar isso de outra perspectiva, os Blockchains melhoram a transpar&#xEA;ncia na an&#xE1;lise de dados.</p>
<p>Ao contr&#xE1;rio dos algoritmos anteriores, a tecnologia Blockchain rejeita qualquer entrada que n&#xE3;o possa&#xA0; ser verificada e &#xE9; considerada suspeita. Como resultado, os analistas das ind&#xFA;strias de varejo s&#xF3; lidam com dados completamente transparentes. Em outras palavras, os padr&#xF5;es de comportamento do cliente que identificados pelos sistemas de Blockchain provavelmente ser&#xE3;o muito mais precisos do que &#xE9; hoje.</p>
<h2><strong><br>
O futuro do Blockchain e as oportunidades para Cientistas de Dados</strong></h2>
<p>Embora o Blockchain ofere&#xE7;a uma grande promessa para a Ci&#xEA;ncia de Dados, a verdade &#xE9; que ainda n&#xE3;o temos muitos sistemas de tecnologia baseados em Blockchain implantados em escala industrial (principalmente no Brasil). Como resultado, as oportunidades e amea&#xE7;as podem n&#xE3;o ser evidentes por pelo menos mais alguns anos at&#xE9; que o Blockchain se torne mais comum.</p>
<p>Entretanto, esta &#xE9; uma tecnologia que promete ser revolucion&#xE1;ria e que trar&#xE1; consigo um novo universo de dados transacionais online. Os estudantes e profissionais que trabalham com dados que almejam trabalhar com Blockchain, certamente possuem um futuro glorioso ainda por vir.</p> </div>
