<div class="entry-content"> <p>Com a popularidade e valoriza&#xE7;&#xE3;o da Ci&#xEA;ncia de Dados, a procura por Machine Learning e por Estat&#xED;stica v&#xEA;m crescendo.</p>
<p>N&#xE3;o h&#xE1; d&#xFA;vida de que ambas as &#xE1;reas s&#xE3;o essenciais quando falamos sobre <strong>Analytics</strong>, no entanto, h&#xE1; uma diferen&#xE7;a significativa na abordagem, aplica&#xE7;&#xF5;es e filosofias dos dois campos, muitas vezes ignorados.</p>
<h3><strong><br>
O que &#xE9; Machine Learning</strong></h3>
<p>Machine Learning &#xE9; um ramo da Intelig&#xEA;ncia Artificial que visa a descoberta autom&#xE1;tica de regularidades em dados atrav&#xE9;s do uso de algoritmos. O foco principal &#xE9; o estudo e o design de sistemas que podem &#x201C;aprender com dados&#x201D; e seu foco &#xE9; a aprendizagem indutiva (aprendendo atrav&#xE9;s de exemplos).</p>
<p><a href="http://joseguilhermelopes.com.br/introducao-ao-machine-learning-e-seus-principais-algoritmos/">Neste artigo</a>, explico com mais detalhes sobre Machine Learning e dou alguns exemplos dos algoritmos principais.</p>
<p>As primeiras aplica&#xE7;&#xF5;es comerciais de Machine Learning surgiram no in&#xED;cio dos anos 90, com detec&#xE7;&#xE3;o de fraude em tempo real, reconhecimento de caracteres e sistemas de recomenda&#xE7;&#xE3;o.</p>
<p>Machine Learning tamb&#xE9;m est&#xE1; intimamente relacionado ao &#x201C;Reconhecimento de Padr&#xF5;es&#x201D;. Enquanto o ML surgiu da Ci&#xEA;ncia da Computa&#xE7;&#xE3;o, o Reconhecimento de Padr&#xF5;es tem ra&#xED;zes da engenharia, entretanto, os dois tem um foco em comum que &#xE9; aprender com dados.</p>
<p>Hoje, o ressurgimento do ML &#xE9; o principal impulso da pr&#xF3;xima grande onda de inova&#xE7;&#xE3;o, em especial quando aplicado &#xE0; <a href="http://joseguilhermelopes.com.br/big-data-nao-se-trata-apenas-de-volume-de-dados/">Big Data</a>.</p>
<p>Os algoritmos de Machine Learning podem ser classificados em Supervisionados e N&#xE3;o-Supervisionados.</p>
<p>A aprendizagem supervisionada inclui:</p>
<ul>
<li><strong>Classifica&#xE7;&#xE3;o</strong>: Previs&#xE3;o de qual classe discreta pertence uma entidade. Por exemplo, se um cliente ser&#xE1; de alto risco.</li>
<li><strong>Regress&#xE3;o</strong>: Previs&#xE3;o de valores cont&#xED;nuos da caracter&#xED;stica de uma entidade. Por exemplo, quanto um indiv&#xED;duo ir&#xE1; gastar no m&#xEA;s que vem no seu cart&#xE3;o de cr&#xE9;dito, com todas as outras informa&#xE7;&#xF5;es dispon&#xED;veis.</li>
<li><strong>Previs&#xE3;o</strong>: estimativa de vari&#xE1;veis macro (agregadas), como as vendas mensais totais de um determinado produto.</li>
<li><strong>Import&#xE2;ncia do Atributo:</strong> Identificando as vari&#xE1;veis que s&#xE3;o as mais importantes na previs&#xE3;o de diferentes resultados de classifica&#xE7;&#xE3;o ou regress&#xE3;o.</li>
</ul>
<p>A aprendizagem n&#xE3;o-supervisionada inclui:</p>
<ul>
<li><strong>Clustering</strong>: Encontrando agrupamentos naturais nos dados.</li>
<li><strong>Modelos de associa&#xE7;&#xE3;o:</strong> Analisando &#x201C;cestas de mercado&#x201D; (por exemplo, novas combina&#xE7;&#xF5;es de produtos que geralmente s&#xE3;o comprados juntos em carrinhos de compras).</li>
</ul>
<p>Alguns exemplos de aplica&#xE7;&#xF5;es de Machine Learning s&#xE3;o:</p>
<ul>
<li>Minera&#xE7;&#xE3;o de dados e an&#xE1;lises preditivas;</li>
<li>Detec&#xE7;&#xE3;o de fraude, coloca&#xE7;&#xE3;o de an&#xFA;ncios, pontua&#xE7;&#xE3;o de cr&#xE9;dito, recomendadores, negocia&#xE7;&#xE3;o de a&#xE7;&#xF5;es, relacionamento com clientes e experi&#xEA;ncia do usu&#xE1;rio;</li>
<li>Processamento e an&#xE1;lise de texto;</li>
<li>Pesquisa na Web, filtragem de spam, an&#xE1;lise de sentimentos;</li>
<li>Gr&#xE1;fico de minera&#xE7;&#xE3;o</li>
<li>Reconhecimento de fala, genoma humano, bioinform&#xE1;tica, reconhecimento &#xF3;ptico de caracteres (OCR), reconhecimento facial, carros aut&#xF4;nomos;</li>
<li>Entre outros &#x2026;</li>
</ul> <h3><strong><br>
Machine Learning vs Estat&#xED;stica</strong></h3>
<p>Historicamente, as t&#xE9;cnicas e abordagens de Machine Learning dependem fortemente do poder de computa&#xE7;&#xE3;o. Por outro lado, as t&#xE9;cnicas estat&#xED;sticas foram principalmente desenvolvidas, onde o poder de computa&#xE7;&#xE3;o ainda n&#xE3;o era uma op&#xE7;&#xE3;o.
.</p><p>
O Machine Learning em geral tende a fazer menos suposi&#xE7;&#xF5;es sobre o problema e &#xE9; liberal em suas abordagens e t&#xE9;cnicas para encontrar uma solu&#xE7;&#xE3;o. O m&#xE9;todo de aprendizagem preferido &#xE9; a aprendizagem indutiva.</p></div>
