<div><div><div class="section-content"><div class="section-inner sectionLayout--insetColumn"><p id="ba46" class="graf graf--p graf-after--h3">Existem muitas formas de armazenar e ler dados. Por esse motivo, uma das tarefas que leva mais tempo no processo de an&#xE1;lise &#xE9; a <em class="markup--em markup--p-em">limpeza </em>e formata&#xE7;&#xE3;o dos arquivos antes da obten&#xE7;&#xE3;o de informa&#xE7;&#xF5;es, ajuste de modelos e outras opera&#xE7;&#xF5;es.</p><p id="70d8" class="graf graf--p graf-after--p">Esse texto &#xE9; &#xFA;til para os leigos que querem formatar um banco de dados antes de entreg&#xE1;-lo a um analista e tamb&#xE9;m para aqueles que come&#xE7;aram a jornada em an&#xE1;lise de dados.</p><figure id="2d38" class="graf graf--figure graf-after--p"><img class="progressiveMedia-noscript js-progressiveMedia-inner" src="https://cdn-images-1.medium.com/max/1600/0*MQXBLmrllSZ526EE.jpg"><figcaption class="imageCaption"><a href="http://jp.servicesource.com/blog/3-steps-getting-your-customer-data-clean-and-lean" class="markup--anchor markup--figure-anchor">http://jp.servicesource.com/blog/3-steps-getting-your-customer-data-clean-and-lean</a></figcaption></figure><p id="187c" class="graf graf--p graf-after--h4">Existe uma forma de organizar dados que &#xE9; bastante popular e recomendada entre analistas. Dizemos que um banco de dados est&#xE1; limpo (<em class="markup--em markup--p-em">tidy</em>) quando:</p><p id="9e0e" class="graf graf--p graf-after--p">1&#x200A;&#x2014;&#x200A;Cada vari&#xE1;vel corresponde a uma coluna.</p><p id="97fe" class="graf graf--p graf-after--p">2&#x200A;&#x2014;&#x200A;Cada observa&#xE7;&#xE3;o corresponde a uma linha.</p><p id="5e8c" class="graf graf--p graf-after--p">3&#x200A;&#x2014;&#x200A;Cada tipo de unidade observacional forma uma tabela.</p><p id="9cda" class="graf graf--p graf-after--p">Um exemplo visual torna as coisas mais f&#xE1;ceis. A seguir, um recorte do banco de dados usado no <a href="https://medium.com/@felipeargolo/o-brasil-precisa-de-mais-m%C3%A9dicos-aa3bbf0f3bd3#.4a3zqvny1" class="markup--anchor markup--p-anchor">post</a> sobre a quantidade de m&#xE9;dicos no Brasil. Temos uma vari&#xE1;vel categ&#xF3;rica (<strong class="markup--strong markup--p-strong">Pa&#xED;s</strong>) e duas num&#xE9;ricas (<strong class="markup--strong markup--p-strong">N&#xFA;mero de m&#xE9;dicos por 1.000 habitantes em 2011</strong> e <strong class="markup--strong markup--p-strong">Expectativa de vida ao nascer</strong>):</p><figure id="e446" class="graf graf--figure graf-after--p"><img class="progressiveMedia-noscript js-progressiveMedia-inner" src="https://cdn-images-1.medium.com/max/1600/1*zDM65bjZRAWC5tAyIkjlbQ.png"><figcaption class="imageCaption">Pa&#xED;s, N&#xFA;mero de m&#xE9;dicos a cada 1000 habitantes em 2011 e Expectativa de vida ao nascer. &#x201C;<em class="markup--em markup--figure-em">NA&#x201D; corresponde a dados faltantes no </em><a href="https://www.r-project.org/" class="markup--anchor markup--figure-anchor"><em class="markup--em markup--figure-em">R</em></a><em class="markup--em markup--figure-em">. Layout do </em><a href="http://www.rstudio.com/" class="markup--anchor markup--figure-anchor"><em class="markup--em markup--figure-em">RStudio</em></a><em class="markup--em markup--figure-em"> </em>Fonte:&#xA0;<a href="http://data.worldbank.org/indicator/SH.MED.PHYS.ZS" class="markup--anchor markup--figure-anchor">WHO</a></figcaption></figure><p id="b68c" class="graf graf--p graf-after--figure">Note que cada linha corresponde a apenas um pa&#xED;s (observa&#xE7;&#xE3;o) e cada coluna representa uma vari&#xE1;vel. Se queremos ver a observa&#xE7;&#xE3;o 9, vamos &#xE0; linha correspondente e podemos encontrar os valores: &#x201C;Armenia&#x201D; (<strong class="markup--strong markup--p-strong">Pa&#xED;s</strong>), &#x201C;2,845&#x201D; (<strong class="markup--strong markup--p-strong">M&#xE9;dicos/1.000 hab</strong>. <strong class="markup--strong markup--p-strong">em 2011</strong>) e &#x201C;71&#x201D; (<strong class="markup--strong markup--p-strong">Expectativa de vida ao nascer</strong>).</p><p id="ba02" class="graf graf--p graf-after--p">Caso esteja come&#xE7;ando a tabular um banco de dados ou escrevendo um programa que gere um, essa forma facilita bastante o trabalho de an&#xE1;lise posterior.</p><p id="019b" class="graf graf--p graf-after--p">Caso seja um analista se deparando com dados brutos, uma boa ideia &#xE9; limp&#xE1;-los, colocando no formato <em class="markup--em markup--p-em">tidy. </em>Assim, a an&#xE1;lise ser&#xE1; fluida e voc&#xEA; poder&#xE1; usar a maior parte das fun&#xE7;&#xF5;es j&#xE1; desenvolvidas sem dificuldades.</p><p id="ecd0" class="graf graf--p graf-after--h3">A seguir, alguns problemas mais frequentes encontrados durante o processo de limpeza e algumas maneiras de resolv&#xEA;-los. Conhecer tamb&#xE9;m &#xE9; uma boa maneira de evitar.</p><p id="7c50" class="graf graf--p graf-after--h4">&#xC9; importante dar nome aos bois. No contexto de pesquisa cl&#xED;nica, manter o nome de um paciente no banco de dados n&#xE3;o &#xE9; permitido, ent&#xE3;o uma alternativa &#xE9; atribuir um n&#xFA;mero de identifica&#xE7;&#xE3;o para cada paciente. Isso facilita a manipula&#xE7;&#xE3;o dos casos no banco de dados.</p><p id="fcec" class="graf graf--p graf-after--h4">Muitas vezes, o dados s&#xE3;o resgatados de bancos n&#xE3;o projetados para an&#xE1;lise. Em sa&#xFA;de, por exemplo, &#xE9; comum resgatar informa&#xE7;&#xF5;es de prontu&#xE1;rios eletr&#xF4;nicos. Muitas vezes, a maneira como cada usu&#xE1;rio digitou n&#xE3;o &#xE9; uniforme.</p><p id="712f" class="graf graf--p graf-after--p">Assim, &#xE9; comum termos algumas maneiras diferentes de se referir &#xE0; mesma informa&#xE7;&#xE3;o: &#x201C;Hipertens&#xE3;o Arterial Sist&#xEA;mica&#x201D;, &#x201C;HAS&#x201D;, &#x201C;Has&#x201D;, &#x201C;has&#x201D;, &#x201C;Hip. Art. Sist.&#x201D;, &#x201C;Diabetes Mellitus&#x201D;, &#x201C;DM&#x201D;, &#x201C;Dm&#x201D;.</p><p id="a840" class="graf graf--p graf-after--p">Caso as palavras sejam digitadas manualmente, &#xE9; importante estabelecer um padr&#xE3;o. Uma alternativa para evitar erros &#xE9; usar c&#xF3;digos num&#xE9;ricos. Ex: Podemos digitar 1 para pacientes que possuam hipertens&#xE3;o. Fazer o processo inverso (n&#xFA;meros para palavras) usando softwares adequados &#xE9; bastante simples.</p><figure id="c52a" class="graf graf--figure graf-after--p"><img class="progressiveMedia-noscript js-progressiveMedia-inner" src="https://cdn-images-1.medium.com/max/1600/1*vtzVsnH7WOlbU4eHUpIh2Q.png"></figure><p id="218d" class="graf graf--p graf-after--figure">Na segunda coluna, temos dados digitados de v&#xE1;rias formas. Na segunda, o uso de c&#xF3;digos durante a digita&#xE7;&#xE3;o impediu inconsist&#xEA;ncias: os pacientes com c&#xF3;digo 1 s&#xE3;o hipertensos.</p><p id="16a5" class="graf graf--p graf-after--h4">Ainda com o exemplo acima, um outro problema &#xE9; que temos informa&#xE7;&#xF5;es sobre duas vari&#xE1;veis (presen&#xE7;a de hipertens&#xE3;o e presen&#xE7;a de diabetes) em apenas uma coluna. Queremos deixar cada vari&#xE1;vel em apenas uma coluna e vamos aproveitar para usar c&#xF3;digos, como descrito acima. O valor 1 corresponde a &#x201C;Sim&#x201D; e 0 a &#x201C;N&#xE3;o&#x201D;.</p><figure id="cbdb" class="graf graf--figure graf-after--p"><img class="progressiveMedia-noscript js-progressiveMedia-inner" src="https://cdn-images-1.medium.com/max/1600/1*BVkTw4DNtJg6xRlJYHOIuw.png"></figure><p id="b05a" class="graf graf--p graf-after--figure">Assim, o primeiro 1&#xBA; paciente apresenta apenas hipertens&#xE3;o (has) e o 6&#xBA; apresenta hipertens&#xE3;o e diabetes (dm).</p><p id="b31d" class="graf graf--p graf-after--h4">O ideal &#xE9; que os dados sejam tabulados (ou extra&#xED;dos) j&#xE1; na maneira <em class="markup--em markup--p-em">tidy</em>. Entretanto, o analista se depara com dados sujos muitas vezes, seja por falhas no planejamento ou no processo de obten&#xE7;&#xE3;o dos dados.</p><p id="913d" class="graf graf--p graf-after--p">As maneiras como os dados podem se apresentar s&#xE3;o infinitas, assim como os procedimentos para deix&#xE1;-los limpos. Ainda assim, na maioria das vezes, a tarefa consiste em transformar texto n&#xE3;o padronizado (&#x201C;Dm, HAS&#x201D;, como nos exemplos da 2&#xAA; coluna da figura) em c&#xF3;digos uniformes (1&#x2019;s e 0&#x2019;s, como nas colunas 3 e 4).</p><p id="17d1" class="graf graf--p graf-after--p">Para evitar o trabalho bra&#xE7;al de ler cada c&#xE9;lula e digitar os c&#xF3;digos, podemos usar o computador e fun&#xE7;&#xF5;es especiais para automatizar o processo.</p><p id="48f2" class="graf graf--p graf-after--p">Antes, vamos gerar dados fict&#xED;cios para nossa pesquisa:</p><figure id="d7cc" class="graf graf--figure graf--iframe graf-after--p"><div class="aspectRatioPlaceholder is-locked"><div class="iframeContainer"><iframe width="700" height="250" src="https://d-van.org/media/95c85662f42a4e54594173d799ebdfc4?postId=d85b8fbe428e" class=""></iframe></div></div></figure><p id="519d" class="graf graf--p graf-after--figure">Primeiras 9 linhas de nosso banco de dados:</p><figure id="5a0d" class="graf graf--figure graf-after--p"><img class="progressiveMedia-noscript js-progressiveMedia-inner" src="https://cdn-images-1.medium.com/max/1600/1*BHmbyrg9koqRdyBvFN3TfQ.png"></figure><p id="7133" class="graf graf--p graf-after--figure">Para uniformizar, podemos fazer uso de algumas fun&#xE7;&#xF5;es para manipula&#xE7;&#xE3;o de strings. O universo por tr&#xE1;s disso &#xE9; grande, mas mostrarei uma implementa&#xE7;&#xE3;o simples com a fun&#xE7;&#xE3;o <em class="markup--em markup--p-em">grep</em> do R:</p><figure id="b0e8" class="graf graf--figure graf--iframe graf-after--p"><div class="aspectRatioPlaceholder is-locked"><div class="iframeContainer"><iframe width="700" height="250" src="https://d-van.org/media/7c9154b5146392663a1876e9ee7738c8?postId=d85b8fbe428e" class=""></iframe></div></div></figure><figure id="8d6d" class="graf graf--figure graf-after--figure"><img class="progressiveMedia-noscript js-progressiveMedia-inner" src="https://cdn-images-1.medium.com/max/1600/1*rXP37NXjOdOLVKuSCTaJ3Q.png"><figcaption class="imageCaption">Banco com nova vari&#xE1;vel ap&#xF3;s nosso&#xA0;script</figcaption></figure><p id="acec" class="graf graf--p graf-after--figure">Agora temos uma vari&#xE1;vel, &#x2018;clean&#x2019;, com apenas um c&#xF3;digo para hipertens&#xE3;o (HAS) e outro para (DM).</p><p id="1b90" class="graf graf--p graf-after--p">Dica: A fun&#xE7;&#xE3;o <em class="markup--em markup--p-em">agrep </em>ajuda e faz uso de Fuzzy Matching. Ela compara o que foi pesquisado com os dados e calcula o n&#xFA;mero m&#xED;nimo de inser&#xE7;&#xF5;es, dele&#xE7;&#xF5;es e substitui&#xE7;&#xF5;es para transformar um valor em outro (<em class="markup--em markup--p-em">Levenshtein edit distance</em>). Ex: HAS pode se tornar HAs com apenas uma substitui&#xE7;&#xE3;o. Voc&#xEA; tamb&#xE9;m pode especificar o n&#xFA;mero m&#xE1;ximo de cada modifica&#xE7;&#xE3;o.</p><figure id="33e5" class="graf graf--figure graf--iframe graf-after--p"><div class="aspectRatioPlaceholder is-locked"><div class="iframeContainer"><iframe width="700" height="250" src="https://d-van.org/media/32f50f327b50f78e6c73cefffac806f5?postId=d85b8fbe428e" class=""></iframe></div></div></figure><p id="c44c" class="graf graf--p graf-after--figure">O universo das express&#xF5;es regulares &#xE9; vasto <a href="http://blog.ricbit.com/2010/07/aritmetica-com-regexp.html" class="markup--anchor markup--p-anchor">e d&#xE1; para fazer muita coisa com elas</a>, portanto n&#xE3;o vamos nos aprofundar no assunto, mas conseguimos</p><p id="31bd" class="graf graf--p graf-after--h4">Codd EF (1990). <a href="http://codeblab.com/wp-content/uploads/2009/12/rmdb-codd.pdf" class="markup--anchor markup--p-anchor">The Relational Model for Database Management: Version 2.</a> Addison-Wesley Longman Publishing, Boston.</p><p id="0973" class="graf graf--p graf-after--p graf--trailing">Wickham, H. (2014). Tidy Data. <em class="markup--em markup--p-em">Journal of Statistical Software, 59</em>(10), 1&#x2013;23. doi:<a href="http://dx.doi.org/10.18637/jss.v059.i10" class="markup--anchor markup--p-anchor">http://dx.doi.org/10.18637/jss.v059.i10</a></p></div></div></div></div>
